public/reading/my-favourite-readings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="reading.html">Reading</a> &gt;
</p>

<div id="outline-container-org534cdda" class="outline-2">
<h2 id="org534cdda">My Favourite Readings</h2>
<div class="outline-text-2" id="text-org534cdda">
<p>
In this note I will try to collect the most influential and Favourite
readings I have done over my lifetime. This is in continuous evolution
as I discover (or remember) things.
</p>

<p>
In no particular order:
</p>

<ul class="org-ul">
<li><a href="https://learnopengl.com/">learnopengl.com</a>: this is how I started with 3D graphics, which
eventually became <a href="https://github.com/San7o/Brenta-Engine">Brenta-Engine</a>. It may not be the best guide out
there, but I would totally recommend it to anybody that wants to
start working with 3D graphics.</li>
<li><a href="https://github.com/nothings/stb">stb</a>: collection of header only libraries. This inspired me to write
my own <a href="https://github.com/San7o/micro-headers">micro-headers</a> and to enter this "sub-genre" of header only,
easy to reuse libraries.</li>
<li><a href="https://www.learncpp.com/">learncpp.com</a>: the absolute best resource to learn about c++, other
than the great <a href="https://en.cppreference.com/index.html">cppreference</a>. This made me appreciate the language
greatly and motivated me to program more and more. C++ conferences
on youtube are great too.</li>
<li>the <a href="https://www.linuxfromscratch.org/lfs/">linuxfromscratch</a> book: compiling and maintaining my own Linux system
from scratch has been one of the best educational projects I have
ever done. I became much more competent and, I have to say, fearless
when it comes to compiling programs / dependencies and customizing
the Linux kernel.</li>
<li><a href="https://en.wikipedia.org/wiki/Hackers:_Heroes_of_the_Computer_Revolution">Hackers: Heroes of the Computer Revolution</a>: great historical book
about hacker culture and the beginning of computing. A wonderful and
informative read, it made me familiar with the legendary names that
shaped the computer world.</li>
<li><a href="https://www.intel.com/content/www/us/en/developer/articles/technical/intel-sdm.html">Intel® 64 and IA-32 Architectures Software Developer’s Manual</a>: the
reference for the Intel architecture. I have nothing else to say,
this is such a monumental book that tells you how to use the
CPU. Super important for writing an operating system on Intel.</li>
</ul>

<hr />

<p>
Travel: <a href="reading.html">Reading</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
